# Midterm

<b>Penalties:</b> You will incur penalties if:
<ul>
<li>Your code is wrong</li>
<li>Your code does not work on different data</li>
<li>You use for loops or list comprehensions (unless explicitly permitted)</li>
</ul>

In [1]:
import pandas as pd
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"
import warnings
warnings.filterwarnings('ignore')

In [2]:
df = pd.read_csv("credit.csv")

<p>This data set reports the information of personal credits situation. Each row is associated to a person, whereas the columns report:
<ul>
<li><b>months_loan_duration</b>: Duration in month
<li><b>credit_history</b>: the person's credit history
<li><b>purpose</b>: the person's credit purpose
<li><b>amount</b>: the person's credit amount
<li><b>employment_length</b>: Present employment since
<li><b>personal_status</b>: the person's marriage situation
<li><b>age, job</b>:the person's age and job situation
</ul></p>
<p>That is all we need to know about the columns' meaning.</p>

In [3]:
df.head(10)

,months_loan_duration,credit_history,purpose,amount,employment_length,personal_status,property,age,job
0,6,critical,radio/tv,1169,> 7 yrs,single male,real estate,67,skilled employee
1,48,repaid,radio/tv,5951,1 - 4 yrs,female,real estate,22,skilled employee
2,12,critical,education,2096,4 - 7 yrs,single male,real estate,49,unskilled resident
3,42,repaid,furniture,7882,4 - 7 yrs,single male,building society savings,45,skilled employee
4,24,delayed,car (new),4870,1 - 4 yrs,single male,unknown/none,53,skilled employee
5,36,repaid,education,9055,1 - 4 yrs,single male,unknown/none,35,unskilled resident
6,24,repaid,furniture,2835,> 7 yrs,single male,building society savings,53,skilled employee
7,36,repaid,car (used),6948,1 - 4 yrs,single male,other,35,mangement self-employed
8,12,repaid,radio/tv,3059,4 - 7 yrs,divorced male,real estate,61,unskilled resident
9,30,critical,car (new),5234,unemployed,married male,other,28,mangement self-employed

In [4]:
df.shape

(1000, 9)

### Question 1

How many people whose credit purpose is education and property is real estate?

In [7]:
len(df[(df.purpose == 'education') & (df.property == 'real estate')])

4

### Question 2

What's the credit history of the guy who has the maxium amount among the whole dataset? Your code must return <b>only one string</b>.

In [92]:
df[df.amount == df.amount.max()].credit_history.values[0]

'fully repaid'

### Question 3

What is the proportion of people (0 to 1) who are younger than 30 and have lower than 24 months loan duration?

In [98]:
float(len(df[(df.age < 30) & (df.months_loan_duration < 24)])) / 1000

0.219

### Question 4

For each employment_length, report how many of those records have over 30 months loan duration. You must report one entry for each employment_length.

In [20]:
df.head(2)

,months_loan_duration,credit_history,purpose,amount,employment_length,personal_status,property,age,job
0,6,critical,radio/tv,1169,> 7 yrs,single male,real estate,67,skilled employee
1,48,repaid,radio/tv,5951,1 - 4 yrs,female,real estate,22,skilled employee

In [97]:
df.groupby("employment_length").agg({'months_loan_duration' : lambda se: len(se[se.values >= 30])}).rename(columns = {'months_loan_duration':'months_loan_duration_over30_months_count'})

                   months_loan_duration_over30_months_count
employment_length
0 - 1 yrs                                                25
1 - 4 yrs                                                70
4 - 7 yrs                                                48
> 7 yrs                                                  57
unemployed                                               13

### Question 5

Report the number of differrent purposes in descending order.

In [43]:
df.groupby('purpose')['purpose'].count().sort_values(ascending = False)

purpose
radio/tv               280
car (new)              234
furniture              181
car (used)             103
business                97
education               50
repairs                 22
others                  12
domestic appliances     12
retraining               9
Name: purpose, dtype: int64

### Question 6

Find how many <u>distinct</u> age for male. <i>Hint</i>: Series.unique() find the list of unique values in a Series.

In [31]:
df.personal_status.unique()

array(['single male', 'female', 'divorced male', 'married male'], dtype=object)

In [35]:
df[df.personal_status != 'female' ].age.unique()

array([67, 49, 45, 53, 35, 61, 28, 60, 25, 31, 48, 44, 26, 36, 39, 34, 63,
       27, 30, 57, 37, 24, 29, 52, 50, 22, 46, 51, 40, 66, 47, 56, 54, 20,
       58, 41, 32, 42, 38, 70, 33, 65, 68, 21, 43, 55, 23, 75, 74, 64, 62,
       59])

### Question 7

For each combination of <i>employment_length</i> and <i>job</i>, what's the average, minimum, and maximum number of amount?

In [41]:
df.groupby(['employment_length','job'])['amount'].agg(['mean','min', 'max'])

                                                  mean   min    max
employment_length job
0 - 1 yrs         mangement self-employed  3612.000000  1337   9398
                  skilled employee         3045.532710   343  15945
                  unemployed non-resident  1727.000000   609   3990
                  unskilled resident       2625.522727   454  11998
1 - 4 yrs         mangement self-employed  6048.071429  1107  18424
                  skilled employee         2993.347826   409  15672
                  unemployed non-resident  1299.000000  1299   1299
                  unskilled resident       2504.462500   250  11590
4 - 7 yrs         mangement self-employed  5958.238095  1199  14179
                  skilled employee         3524.319328   609  15653
                  unskilled resident       2417.000000   385   9857
> 7 yrs           mangement self-employed  5446.340000   629  14896
                  skilled employee         2907.537037   338  11816
                  unskilled resident       1768.097561   339   6143
unemployed        mangement self-employed  5450.757576  1050  15857
                  skilled employee         2495.916667   433   5293
                  unemployed non-resident  3153.687500   672  14555
                  unskilled resident       1154.000000  1154   1154

### Question 8

Let us define "average amount of an age" as the average amount of that age. Find the age group of which the average amount is 20% higher than the average amount of all records. Report both the age and its average amount.

In [44]:
df.head(2)

,months_loan_duration,credit_history,purpose,amount,employment_length,personal_status,property,age,job
0,6,critical,radio/tv,1169,> 7 yrs,single male,real estate,67,skilled employee
1,48,repaid,radio/tv,5951,1 - 4 yrs,female,real estate,22,skilled employee

In [46]:
age_amount_se = df.groupby('age')['amount'].mean()

In [48]:
average = df.amount.mean()

In [51]:
age_amount_se[((age_amount_se - average) / average )> 0.2]

age
30    3966.875000
42    4211.318182
44    4236.764706
45    4453.933333
53    4770.428571
58    5219.000000
59    4275.000000
60    4777.833333
63    4753.125000
68    7610.666667
70    7308.000000
75    3994.500000
Name: amount, dtype: float64

### Question 9

Display only those columns that, across the whole data set, contain more than 6 distinct values. You can use for loops or list comprehension for this problem. Hint: the method nunique() returns the number of unique values in a Series.

In [87]:
for column in df.columns:
    if df[column].nunique() > 6:
        column

'months_loan_duration'

'purpose'

'amount'

'age'

'loan_duration_per_year_of_age'

### Question 10

A metric we are interested in is the "person's loan duration per year of age", which is computed as loan duration / age. Among those amount higher than average , show the details of the person (or people in case of ties) who has/have the largest number of loan duration per year of age.

"person's loan duration per year of age"这个Metric很拗口， 而且很不好理解，虽然告诉了怎么计算，但是用一个人的借的贷的周期除以他现在的年纪感觉不是什么有用的指标。 题可以做出来，但是会给人感觉很混乱。 感觉这道题可以放弃然后重出一道

In [80]:
df.head(2)

,months_loan_duration,credit_history,purpose,amount,employment_length,personal_status,property,age,job,loan_duration_per_year_of_age
0,6,critical,radio/tv,1169,> 7 yrs,single male,real estate,67,skilled employee,0.089552
1,48,repaid,radio/tv,5951,1 - 4 yrs,female,real estate,22,skilled employee,2.181818

In [79]:
df['loan_duration_per_year_of_age'] = df.months_loan_duration / df.age

In [83]:
df2 = df[df.amount  > df.amount.mean()]

In [86]:
df2[df2.loan_duration_per_year_of_age == df2.loan_duration_per_year_of_age.max()]

,months_loan_duration,credit_history,purpose,amount,employment_length,personal_status,property,age,job,loan_duration_per_year_of_age
677,72,repaid,radio/tv,5595,1 - 4 yrs,married male,other,24,skilled employee,3.0